l08/app/controllers/players_controller.rb

  def champions
    @players = Player.all
---
SELECT "players".* FROM "players"

  def home
    @players = Player.where.not(name: nil)
---
SELECT "players".* FROM "players" WHERE "players"."name" IS NOT NULL

  def form
    @player = Player.new
    @player.name = params[:name]
    @player.death_year = params[:death_year].to_i
    @player.birth_year = params[:birth_year].to_i
    @player.save
---
INSERT INTO "players" ("name", "birth_year", "death_year", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Test"], ["birth_year", 1954], ["death_year", 1999], ["created_at", "2018-12-09 11:35:43.828517"], ["updated_at", "2018-12-09 11:35:43.828517"]]